{
    "lang" : "en",

    "navbar":
    {
        "home" : "Home",
        "about" : "About",
        "contact" : "Contact",
        "language" : "Language",
        "tamil" : "Tamil",
        "english" : "English",
        "japanese" : "Japanese",
        "nightmode" : "Night Mode"
    },

    "homepage":
    {
        "time" : "Time now is",
        "goodMorning" : "Good Morning",
        "goodAfternoon" : "Good Afternoon",
        "goodEvening" : "Good Evening",
        "goodNight" : "Good Night",
        "midnight" : "It's almost midnight",
        "prettyQuick" : "You got up pretty quick",

        "welcome" : "Welcome",
        "whyWebsite" : "So, What is this Website ?",
        "whyWebsiteReason" : "First, Let me introduce myself. I am Kishore Prabhu. I am a Mechanical Engineer by education, Full-Stack Developer by profession (in near future), and a Game Developer by ambition. I wanted to develop a website from scratch, so that I could become more adept in my field.",
        
        "technologiesUsed" : "Technologies used to make this website",
        "htmlcssjsDescription" : "What page doesn't ? ",
        "reactjsDescription" : "React JS is a Javascript library, and this one makes implementing Javascript a lot easier.",
        "bootstrapDescription" : "If React JS makes Javascript implementation easy, Bootstrap makes CSS implementation easy. One just need to add classes and they are good to go.",
        "nodejsDescription" : "Every page needs some nice backend to make it dynamic. Node JS is here to help.",
        
        "statisticsHeading" : "Some nice statistics on this page",
        "programming" : "Hours of Programming",
        "coffee" : "Cups of Coffee",
        "thinking" : "Hours of Thinking",

        "aboutThis" : "About this",
        "aboutThisDescription" : "Want to know more about some more? Click any of below boxes.",
        "aboutMe" : "About me",
        "aboutMeDescription" : "\"The most least\" interesting content of this website, coming up!",
        "aboutMeDescriptionUnder" : "Well, well, you made it this far.",
        "aboutWebsite" : "About this Website", 
        "aboutWebsiteDescription" : "A story of me and this website, how I made it, how much it took, and more.", 
        "aboutWebsiteDescriptionUnder" : "Just a click away.", 
        "knowMore" : "Know More",

        "commentsHead" : "Comments",
        "saySomething" : "Want to say something public on this website?",
        "cantFetchComments" : "Something happened and cannot fetch comments just now.",
        "alreadyEntered" : "It seems you have already entered your opinion.",
        "commentButton" : "Comment",
        "enterName" : "Enter your name *",
        "enterEmail" : "Enter your E-mail ID *",
        "enterBody" : "What are you thinking ? * (Max 255 characters)"
    },

    "contact" :
    {
        "heading" : "Contact",
        "fillText" : "Want to say something in private about this page or have any suggestions?",
        "submitButton" : "Send E-mail",
        "enterName" : "Enter your name *",
        "enterEmail" : "Enter your E-mail ID *",
        "enterSubject" : "Subject",
        "enterBody" : "What are you thinking ? *",
        "required" : "Fields required are marked by *",
        "sharing" : "By entering your E-mail ID, you are sharing it to me.",
        "mailSent" : "Mail sent successfully."
    },

    "about" :
    {
        "heading" : "About",
        "fillText" : "Here, your path diverges.. Choose a path.",
        "aboutMe" : "About me",
        "aboutWebpage" : "About webpage",

        "myselfPage" : {
            "aboutMe" : "About me",
            "congrats" : "If you have made it this far, congratulations! You really are exploring this webpage. I can't ask more. Thank you.",
            "introduction" : "Introduction",
            "introductionPara1" : "I am Kishore Prabhu. Mechanical Engineer by education, Full-Stack Developer by profession (in near future), and a Game Developer by ambition, and always a language lover. I am from Erode, Tamil Nadu, India. I know four languages. This is my first website from scratch (Built from zero). I am using Heroku as a cloud platform for my web application.",
            "languagesKnown" : "Languages Known",
            "languagesKnownPara1" : "Learning languages one of my hobbies. Languages I know are listed below in decreasing proficiency.",
            "tamil" : "Tamil",
            "english" : "English",
            "japanese" : "Japanese",
            "chinese" : "Chinese",
            "languagesKnownSkill1" : "Read, Write, Speak, Listen, Think",
            "languagesKnownSkill2" : "Read, Write, Speak",
            "skillsets" : "Skill sets",
            "skillsetsPara1" : "Can learn any skill very quickly. For example, take this website. I do not know what is CSS before 2020 February, but now, I was able to build this web app.",
            "skillsetsPara2" : "Now, I know how to build a web app using React JS and I was able to learn the concepts of front and back end properly within a month, and I was able to build a web app with a beginner level back end using Node JS. I took 5 days for me to learn Node, and it was entirely a new concept.",
            "skillsetsPara3" : "Also, I can learn anything by myself mostly and I do not hesitate to ask help.",
            "strengths" : "Strengths",
            "strengthsPara1" : "Here are some of my strengths",
            "strengthsList1" : "Can learn any technology or language quickly",
            "strengthsList2" : "Easily adapts to the environment",
            "strengthsList3" : "Expects perfection",
            "strengthsList4" : "Very patient",
            "weaknesses" : "Possible weaknesses",
            "weaknessesPara1" : "As a human, I have my weaknesses as well. Some of them are,",
            "weaknessesList1" : "Expects perfection to a level that sometimes even I myself cannot achieve",
            "weaknessesList2" : "Lazy",
            "weaknessesList3" : "Hates books and other materials, expects interactive or video content for learning",
            "weaknessesList4" : "Dislikes outdoor activities",
            "weaknessesList5" : "Mostly patient, but if something feels wrong, I do not hesitate to drop something that I have been doing for a long time",
            "weaknessesList6" : "Very forgetful",
            "whatIsCmg" : "What does KishoreCMG mean?",
            "whatIsCmgPara1" : "Nothing. It's just series of letters to avoid numbers in my E-mail. ",
            "hobbies" : "Hobbies",
            "hobbiesPara1" : "Playing PC games is my most favourite hobby, learning something new is my second. I watch films, web series, or sports once in a blue moon. Also, I do not listen to songs mostly, but if I do, that would be mostly A.R.Rahman's music.",
            "hobbiesLink1" : "Here's my most favourite one.",
            "hobbiesPara2" : "Hearing this would make me go like ~ adada dada dada adadada ~",
            "gamesPlayed" : "Games I have played",
            "gamesPlayedPara1" : "Well, It's a very loooong list, and I won't stop playing.",
            "gamesPlayedPara2" : "This list might not seem like much, but I have played each game atleast around 70~80 hours, and played TES V: Skyrim around 1000 hours, The Witcher III around 500 hours and Fallout IV around 450 hours.",
            "gamesPlayedPara3" : "And, I haven't included NES games, adding that makes this list even more long.",
            "closeAll" : "Close all",
            "returnToMain" : "Return to About page",
            "returnToAboutWebpage" : "About this webpage"
        },
        "webpage" : {
            "aboutPage" : "About this Web app",
            "aboutPageDescription" : "If you make it to this page, I am certain that you are ready to hear a story. A nice story.",
            "whyPage" : "Why I made a website",
            "whyPagePara1" : "Because I had to. I mean, I had to practice all I learnt and building a web app from scratch would be a nice practice. Also \"something\" happened that I had to forget and learning to build a web app seemed like a great idea to forget that special \"something\". ",
            "challenges" : "Challenges I came across",
            "challengesPara1" : "First of all, I am a Mechanical Engineer who didn't knew any programming language except C and a little bit of Python before February 2020. But, I always had a liking on programming and so that is not the problem. I hadn't even heard the word \"CSS\" before this and I tell you this, it was a rough ride. But I managed to make it. ",
            "challengesPara2" : "I came across this meme and I can't keep myself from posting this here. I like how this says how difficult it is to create a content.", 
            "challengesPara3":"I learnt the basics of both front-end and back-end part of web development, and I was sure that I could be able to build a site. But the answer I got was \"no\". Because I was taught \"How to make a web page\" and not \"How to make a website\". I really cannot blame the education I was given, it was for the beginners and it was not enough for me. So I went for more knowledge, and I am sure that I got what I wished for. ",
            "techUsed" : "Applications used",
            "techUsedPara1" : "The field of Computer Science is highly dependent on the type of technology it is built on. This web app is made using \"SERN stack\". It stands for,",
            "techUsedPara2" : "Also, I used the following applications to build this app.",
            "attribution" : "Images and Icons took from",
            "attributionPara1" : "It is important to attribute the sources of images and SVG icons used, no?",
            "timetook" : "Time took to finish",
            "timetookPara1" : "It took around a month, and below is the list describing the development time period",
            "firstTenDays" : "First 10 days",
            "firstTenDaysSide" : "Basic and complex part of the page, including adding multiple languages and adding a dialog box, a router and a loading screen.",
            "secondTenDays" : "Next 10 days",
            "secondTenDaysSide" : "Learnt and added server side for the web app, and added comment section and E-mailing service to the web application.",
            "thirdTenDays" : "Last 10 days",
            "thirdTenDaysSide" : "Finally combined all the files and made it to a single web app and removed unnecessary parts and improvised the overall stability of the app.",
            "translations" : "Translations",
            "translationsTamil" : "Tamil",
            "translationsJapanese" : "Japanese",
            "translationsEnglish" : "English",
            "translationsTamilSide" : "Myself",
            "translationsJapaneseSide" : "Myself",
            "translationsEnglishSide" : "Myself",
            "futureExpansion" : "Future expansions for this web app",
            "futureExpansionPara1" : "These could be some of the future plans for this website.",
            "futureExpansionList1" : "Make comments more functional",
            "futureExpansionList2" : "Add a game or two",
            "futureExpansionList3" : "Make this website free of BootStrap",
            "futureExpansionList4" : "Make this website more linguistically diverse",
            "seeSource" : "Source files",
            "seeSourcePara1" : "Want to see the source files of this web app?",
            "seeSourceLink1" : "Click here to see source in GitHub",
            "seeSourcePara2" : "And guess what? You could even contribute to this web app on GitHub!",
            "closeAll" : "Close all",
            "returnToMain" : "Return to About page",
            "returnToAboutMyself" : "About myself page"
        }
    },

    "dialogbox" :
    {
        "areYouSure" : "Do you want to change the language?",
        "description" : "To change the language again, click the languages list tab.",
        "agree" : "Agree",
        "disagree" : "Disagree"
    },

    "errorpage" :
    {
        "error404" : "Error 404",
        "clickhome" : "You have strayed from the path. Seek \"Home\" to return to the beaten path."
    }
}